content-org/all-posts.org
#+hugo_base_dir: ../
#+hugo_section:


** DONE My year with a Zettelkasten
:PROPERTIES:
:EXPORT_FILE_NAME: my-year-with-zettelkasten
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :featured_image /img/featured_my-year-with-zettelkasten.jpg :f_alt "An image of a graph of a few hundred nodes of different colours connected with lines."
:EXPORT_DATE: 2023-12-31
:EXPORT_HUGO_TAGS: "Knowledge work" Writing
:EXPORT_HUGO_CATEGORIES: "Knowledge work" Zettelkasten Learning Writing
:END:

It is almost a tradition for people who get hooked on Zettelkasten to write a blog post about it. After using it for a year, I think it is about time I followed this tradition and added my experiences.

I have always been a note-taker. I feel a strong urge to capture thoughts, events and ideas that are important to me. Over the years, I have been using a bunch of apps, paper notebooks, different kinds of files and folder systems to try to keep some order in my notes. No matter how hard I tried though, it always ended up being a mess, sooner or later. I think I sort of accepted that as an inevitable part of life. That notes were temporary -- only good for helping me acquire the knowledge, but useless for long term storage. Now all of that changed with Zettelkasten.

*** What is a Zettelkasten
There are much better explanations of what a Zettelkasten is and how it works than I could put together here. One of the very best ones is [[https://zettelkasten.de/introduction/][Introduction to the Zettelkasten Method on zettelkasten.de]], so if you want a proper in depth introduction, head over there. ([[https://zettelkasten.de][zettelkasten.de]] is hands-down the best resource about all thinks Zettelkasten and they have a great forum too.)

In short, a Zettelkasten is a way of note-taking based on creating a network of interconnect thoughts/notes. It can be done both physically, the old-school way with a filing cabinet full of paper slips (Zettelkasten is German for "slip box"), or digitally with the many note-taking apps and software solutions available. The only things necessary are a way of uniquely identifying and finding each note and a way to implement bidirectional links. 

Using index cards for note-taking used to be a pretty common thing. However, what most people mean when they talk about a Zettelkasten nowadays is a bit more specific.

Modern Zettelkästen (that is plural for Zettelkasten), are inspired by the work of Niklas Luhmann, a 20th century German sociologist who built a Zettelkasten of about 90,000 cards and used it to help him write over 50 books and 550 articles. He also wrote a book about his practice, called Communicating with Slip Boxes.

Sönke Ahrens brought new attention to the Zettelkasten method in his [[https://www.soenkeahrens.de/en/takesmartnotes#zettelkasten-en][book How to Take Smart Notes]], where he explains what a Zettelkasten is and how to use it.


*** The basic principles of a Zettelkasten
What makes a bunch of notes into a Zettelkasten, is 3 basic principles.

1. *Atomic notes*.
   
   Each note should contain one piece of knowledge only. Now, personally, I find this principle to be the most difficult to follow, because I am often not sure what counts as "one piece of knowledge", although I am getting better at it with practice. There is usually a sweet spot for how granular the notes can be and thanks to the flexibility of digital tools, it's not that difficult to split up notes that have grown a bit too much.
   The note atomicity is important to facilitate the second principle, which is:
2. *Links between notes*.
   
   You make links between notes by referencing them. It's sort of like a wiki, but with atomic notes. This way, it is possible to link to one note from many other notes, making connections between loads of different ideas.
3. *Writing with own words*.
   
   The last principle is about writing the notes with your own words rather than copying straight from the source. This forces you to process the thoughts, and to make them your own. It is also important to write the notes "properly", so they can work on their own. You need to have the audience in mind, which in this case is your future self that has forgotten everything about this idea.

*** A system meant to grow
My problem with notes has always been that at some point they become unmanageable. Truth is, I didn't have much of a system at all. I tried to organise them, of course. Folders within folders of difficult to navigate hierarchies always inevitably became a mess where finding whatever I was looking for was almost impossible.

For me, notes were mostly a learning aid, I used them to prepare for exams and finish projects, but once that was over, they would lie forgotton. Whenever I would try to get back to them months or years later, needing to refresh some of that knowledge, I found them too telegraphic, not giving enough context and explanations, lacking, disorganized and hard to navigate. I would usually toss them at that point, disappointed over the waste of time and effort that went into taking them.

When I first heard about Zettelkasten last January, I was intrigued. Now, a year and almost 500 notes later, I can say it works.

Instead of trying to organise notes hierarchically into hard-to-navigate folders, all of my notes are in a single folder. Instead of trying to write notes as comprehensive as possible, each note is dedicated to one thought -- one idea, that I try to capture as best I can in the title. 

It is easy to make a new note, because I don't have to immediately think about where to file it. It simply goes into The Folder. It is equally easy to find it later by a simple keyword search of the files.

My previous methods to organise notes were rigid, top-down approaches trying to fit things into a predetermined structure. The moment something unexpected showed up, the structure had nowhere to grow, the only thing I could do was tear it down, redesign the structure, and start again.

A Zettelkasten, on the other hand, only gets /better/ with more and more notes. There is no predetermined structure, no hierarchy, all the notes are on an equal footing, as are all the ideas and topics. The structure emerges on its own from the notes themselves. If we really are learning, what we learn is bound to surprise us. Trying to define a structure for our note collection beforehand is like trying to come up with a conclusion before we did the research. That is at best inconvenient and at worst deeply unscientific. A Zettelkasten allows us to capture all that is relevant to a topic, not only what fits the predetermined narrative.

A Zettelkasten grows organically, bottom up.

