content/post/my-year-with-zettelkasten.md


## A place to think {#a-place-to-think}

As I already talked about in [a blog post about my reasons for blogging](https://noriparelius.com/post/my-reasons-for-blogging/), David McCullough said "Writing is thinking," and I very much agree. Putting words to paper (or even just saying them) forces us to give the thoughts and ideas actual form, taking them from the level of abstract possibilities into reality. Sometimes I feel like I need to write to even find out what exactly I am thinking.

A Zettelkasten is a perfect companion where a lot of this writing/thinking can happen. It demands that I formulate my thoughts clearly, trying to extract the atomic ideas from whatever I am thinking and express them fully in my own words.

The magic of Zettelkasten is in the links though. Making sure that a new note gets integrated into the network means I have to think about it in context, look at related ideas, write about the connections between them and revisit old notes. It allows my present me to interact with what my old me has been thinking and writing.

A lot of the thinking happens in the so-called structure notes (or map-of-content notes) where we can bring together a number of ideas and connect them into something new, linking to the individual notes. These notes allow us to take a step back, look at the bigger picture and integrate ideas rather than breaking them down.


## Zettelkasten is a real Memex {#zettelkasten-is-a-real-memex}

Memex -- short for memory expander -- is a fictional machine from a 1945-book "As we may think" by Vannevar Bush (which I haven't read, actually, just heard about). Memex organises a user's thoughts and semi-automatically brings related ideas together. A number of bloggers were inspired by memex, among them one of my favourites -- Cory Doctorow ([his blog post about The Memex Method](https://pluralistic.net/2021/05/09/the-memex-method/)).
Memex might be fictional, but Zettelkasten does what memex sets out to do. It is a way to organise one's thoughts and provide a framework for connecting them.

The godfather of Zettelkasten, Niklas Luhmann, talked about his Zettelkasten more as a writing partner than a mere tool. One would almost get the impression that his Zettelkasten was alive.

At this point, my Zettelkasten has almost 500 notes, and I have been using it almost daily for a year. Despite that, I am definitely still just a beginner Zettelnaut (a wonderful word that, as far as I know, comes from Will at the zettelkasten.de forum). My Zettelkasten is very much not alive, but I can imagine that when it grows to several tens of thousands of notes, it would hold more than my brain is capable of, and then it would surely have some surprises for me. I am already looking forward to that.


## Making a mosaic {#making-a-mosaic}

For me, reading books has become so much more intentional. That is where the majority of my Zettelkasten inputs come from. I read, and I take notes and I connect the new ideas to the old ideas, finding unexpected connections that deepen my understanding and refine my thinking. And it's fun (I think we have already established that I have weird ideas about fun).

I find Zettelkasten to be freeing, because it lowers the threshold for taking notes. I don't have to think about where to put the note, or whether it is important enough to write down. Time will tell. That is one of the most exciting things about a Zettelkasten -- seeing where my interests are. It is like watching topics crystalize out of the dense soup of ideas, or grow like mushrooms from a rich mycelium, or like images showing themselves when you take a step back from painstakingly building a mosaic.


## Who is it for {#who-is-it-for}

I do enjoy working with my Zettelkasten and find it useful and enriching. But I don't think everyone needs one. Zettelkasten requires a fair amount of work, and it is not a magic pill that will output great new ideas on its own. In the end, it really is just a way of taking and organising notes.

I think it can be a great tool/companion for anyone doing research, be it scientists, non-fiction writers, journalists, students or bloggers.

_Update_: [Here you can read how I abandoned Zettelkasten about a year after I wrote this post](https://www.noriparelius.com/post/goodbye-zettelkasten)
