content/post/my-year-with-zettelkasten.md


## My Zettelkasten set up {#my-zettelkasten-set-up}

This last part is very much only for people who want to start a Zettelkasten and are curious about other people's set up. I know I was, when I was starting out. The most important thing I can say though, is that you do you.

When setting up my Zettelkasten, I followed these principles:

1.  **Principle precedes procedure**.

    I wanted to make sure that how I do things and what I do isn't decided by the tools I have available, but rather by the principles I want to implement (such as the Zettelkasten principles). You wouldn't first get a hammer and then go around looking for things to smash with it.

2.  **Prioritise longevity**

    The idea of having one Zettelkasten for the rest of my life really appealed to me (I am like a dragon, I like to sit on treasures). Trying to increase the chances that my notes will survive half a century is not completely trivial though.

3.  **Keep it simple**

    A principle on its own, but also a consequence of the previous two. Keeping it simple to make it as easy as possible to take notes, maintain the system, move it to a different software and so on.

I started my Zettelkasten in Obsidian and within two months moved it to org-roam in Emacs. I still think Obsidian is a great piece of software and there was nothing wrong with it. The reason I switched was that I wanted something non-proprietary and open source, and something that might survive for a while. Emacs gets a lot of extra points for the longevity.

Another reason I left Obsidian behind is the amount of cool plugins it provides. While they were very tempting, I ultimately didn't want to be adding unnecessary complexity to something that can (and should) be fairly simple.

When I switched to Emacs, I was an Emacs newbie and the learning curve was steep and fun (as I said, I have a weird idea of fun), but also absolutely maddening and at one point I was even wondering whether everyone who claims to like Emacs is just a victim of Stockholm Syndrome and Sunken cost fallacy. Anyway, I got over the hump, set things up the way I like them, and haven't tinkered ever since.

Would I recommend Emacs to others? Well, if you have some coding basics, love to tinker, are stubborn as hell and like to disappear into rabbit holes, then maybe. If not, there are a lot of nice Zettelkasten software solutions that work with plain text files, so if you are worried about longevity, you know that you can still open your notes if your software disappears. One thing to remember though might be to try not to rely on super fancy features that you might not find elsewhere.

To reduce friction of creating notes and of possible future software transfers, I am trying to keep my metadata to a minimum.

I use a datetime stamp in the title of the note files, which tells me when the file was created. All my zettels are in one folder only, but I have two additional folders, that are adjecent to the Zettelkasten, but not quite part of it. I call these inputs and outputs.

Inputs might be called "fleeting notes" by some. In my workflow, these are the files where I take notes from whatever I am reading or watching. I will use one file per book, for example, so these notes are not atomic in any way. Then I go through them and extract the ideas that I want to make proper zettels out of.

My Zettelkasten is for me only, and would probably provide little value for anyone else. Whenever I want to make something for others, I put the draft into the "outputs" folder, where I can still link to the proper notes, but hold these compositions separate.

I am not much of a tagger, and other than #MOC (for map of content), I don't use other tags. Yet. Instead, I rely on links and structure notes (MOCs) to help me find things and orient myself. Categories provide only weak associations and things like tags don't scale very well. Sooner or later, you will find yourself with too many tags and too many notes per tag. But we will see, maybe there will come a time when I will decide to add tags to my zettels.

I use pretty much a standard org-roam setup for my Zettelkasten, with quite a few elements inspired by [the org-roam setup of Jethro Kuan](https://jethrokuan.github.io/org-roam-guide/) who made org-roam.

I use Zotero to keep my references and Better BibTex to export them into a single .bib library.
To then insert the references into the notes, I use citar and citar-org-roam packages.

I use capture templates for zettel, input, output and reference notes. A reference note is an input note that is linked to a bibliography entry. The capture template will put the note into the correct folder, create a filename with a datetime tag and put the title into the note. The filename also includes -I- for input notes and -O- for output notes and the capture template adds an "input" or "output" tag to input and output notes.

```elisp
;; ORG-ROAM
(use-package org-roam
	     :ensure t
	     :custom
	     ;; setting up the directory
	     (org-roam-directory "~/Documents/TheNotes/")
	     (org-roam-completion-everywhere t)
	     ;; org roam capture templates
	     (org-roam-capture-templates
	      '(("d" "default" plain
		 "%?"
		 :target
		 (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}")
		:unnarrowed t)
		("z" "zettel" plain
		"%?"
		:target
		(file+head "zettel/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}")
		:unnarrowed t)
	       	("o" "output" plain
		"%?"
		:target
		(file+head "output/%<%Y%m%d%H%M%S>-O-${slug}.org" "#+title: O-${title}\n#+filetags: :output")
		:unnarrowed t)
  	        ("i" "input" plain
		"%?"
		:target
		(file+head "input/%<%Y%m%d%H%M%S>-I-${slug}.org" "#+title: I-${title}\n#+filetags: :input")
		:unnarrowed t)
	        ("r" "reference" plain
		"%?"
		:target
		(file+head "%(expand-file-name \"input\" org-roam-directory)/%<%Y%m%d%H%M%S>-I-${citekey}.org" "#+title: I-${citekey}\n#+filetags: :input")
		:unnarrowed t)
		)
	      )
	     :bind (("C-c n l" . org-roam-buffer-toggle)
		    ("C-c n f" . org-roam-node-find)
		    ("C-c n i" . org-roam-node-insert)
		    ("C-M-i" . completion-at-point))
	     :config
	     (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:20}" 'face 'org-tag)))
	     (org-roam-db-autosync-mode t)

	     )
```

This part modifies the display template to show the tags associated with the note.

```elisp
(setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:20}" 'face 'org-tag)))
```

I use a completely standard setup for citar:

```elisp
;; CITAR
(use-package citar
  :ensure t
  :custom
  (setq org-cite-global-bibliography "/home/nori/Documents/TheNotes/biblio.bib")
  (citar-bibliography "/home/nori/Documents/TheNotes/biblio.bib")
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar)
  :bind
  (:map org-mode-map :package org ("C-c b" . #'org-cite-insert))
  )
```

Citar org roam allows me to use my roam capture template to make a note from a reference. When I run `citar-open`, I can choose a bibliography entry for which I want to create an org-roam note following my 'reference' capture template.

```elisp
;; CITAR-ORG-ROAM
(use-package citar-org-roam
  :ensure t
  :after citar org-roam
  :no-require t
  :config
  (setq citar-org-roam-capture-template-key "r")
  )
```
